# Pertemuan 13 Pandas 51
## Sumber : https://youtu.be/yzpARuObplg
## Selesi baris pada data frame dengan between()

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

## Data Frame

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size =(n_rows, n_cols)),
                 columns = cols)
df

   A  B  C  D  E
0  8  5  3  6  6
1  7  5  1  2  1
2  3  1  7  2  2
3  1  8  8  7  1
4  2  9  6  3  1
5  3  9  6  7  7
6  6  4  3  4  6
7  6  9  8  1  1
8  1  2  1  1  4
9  9  1  5  9  2

### Selesi baris dengan `between()`

In [4]:
df[df['A'].between(2,5)]

   A  B  C  D  E
2  3  1  7  2  2
4  2  9  6  3  1
5  3  9  6  7  7

- `df['val']` digunakan untuk melakukan sorting
- `between(val1,val2)` digunakan untuk value ke satu digunakan untuk starting dan value ke dua digunakan untuk ending.
- methode ini bersifat inklusif maksudnya nilai batasan starting dan ending akan disetakan

In [5]:
df[df['A'].between(2,5,inclusive = False)]

   A  B  C  D  E
2  3  1  7  2  2
5  3  9  6  7  7

- menggunakan `inclusive = False` maka nilai starting dan ending tidak akan di sertakan.